terraform plan output:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.user_buckets["persistent-public"] will be created
  + resource "google_storage_bucket" "user_buckets" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "m2lines-persistent-public"
      + project                     = "m2lines-hub"
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # google_storage_default_object_access_control.public_rule["prod.persistent-public"] will be created
  + resource "google_storage_default_object_access_control" "public_rule" {
      + bucket       = "m2lines-persistent-public"
      + domain       = (known after apply)
      + email        = (known after apply)
      + entity       = "allUsers"
      + entity_id    = (known after apply)
      + generation   = (known after apply)
      + id           = (known after apply)
      + project_team = (known after apply)
      + role         = "READER"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ buckets = {
      + persistent-public  = "m2lines-persistent-public"
        # (4 unchanged elements hidden)
    }

```